#Использовать asserts

Перем юТест;

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;
	
	ВсеТесты.Добавить("ТестДолжен_ПроверитьВерсию");
	
	Возврат ВсеТесты;
КонецФункции

Процедура ПередЗапускомТеста() Экспорт
//TODO вставить в журнал для проверки последовательности вызова    
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
//TODO вставить в журнал для проверки последовательности вызова    
КонецПроцедуры

Процедура ТестДолжен_ПроверитьВерсию() Экспорт
//TODO вставить в журнал для проверки последовательности вызова    
	Утверждения.ПроверитьРавенство("0.1", Версия());
КонецПроцедуры

Функция Версия()
	Возврат "0.1";
КонецФункции
