#Использовать asserts
#Использовать "./internal"

Перем TestTools;

#Область Тесты

&ТестовыйНабор(Характер = "Одиночка")
Процедура ПриСозданииОбъекта()
	
	TestTools = Новый TestTools("ru");

	
КонецПроцедуры

&Порядок(1)
&Тест
Процедура СоздатьПроект() Экспорт
	
	Проект = ПолучитьИмяВременногоФайла();
	
	Опции = Новый Структура;
	Опции.Вставить("path", Проект);
	
	Результат = TestTools.ВыполнитьТестCLI("СоздатьПроект", Опции);
	
	Ожидаем.Что(Результат["path"]).Равно(Проект);
	Ожидаем.Что(Результат["result"]).Равно(Истина);
	
	TestTools.ЗаписатьЛог(Результат, "СоздатьПроект");
	
	УдалитьФайлы(Проект);
	
КонецПроцедуры

#КонецОбласти