#Использовать asserts
#Использовать "./internal"

Перем ПутьПроекта;
Перем КлючОбработчика;

#Область Тесты

&ТестовыйНабор(Характер = "Одиночка")
Процедура ПриСозданииОбъекта()
	
	Если Не ЗначениеЗаполнено(ПутьПроекта) Тогда
		ПутьПроекта = ПолучитьИмяВременногоФайла();
		
		Опции = Новый Структура;
		Опции.Вставить("path", ПутьПроекта);
		
		Результат = TestTools.ВыполнитьТестCLI("СоздатьПроект", Опции);	
	КонецЕсли;
	
КонецПроцедуры

&Порядок(1)
&Тест
Процедура СоздатьПроект() Экспорт
	
	Проект = ПолучитьИмяВременногоФайла();
	
	Опции = Новый Структура;
	Опции.Вставить("path", Проект);
	
	Результат = TestTools.ВыполнитьТестCLI("СоздатьПроект", Опции);
	
	Ожидаем.Что(Результат["path"]).Равно(Проект);
	Ожидаем.Что(Результат["result"]).Равно(Истина);
	
	TestTools.ЗаписатьЛог(Результат, "СоздатьПроект");
	
	УдалитьФайлы(Проект);
	
КонецПроцедуры

&Порядок(2)
&Тест
Процедура ПолучитьНастройкиПроекта() Экспорт
	
	Опции = Новый Структура;
	Опции.Вставить("proj", ПутьПроекта);
	
	Результат = TestTools.ВыполнитьТестCLI("ПолучитьНастройкиПроекта", Опции);
	
	Ожидаем.Что(Результат["result"]).Равно(Истина);
	Ожидаем.Что(Результат["data"]).ИмеетТип("Массив");
	
	TestTools.ЗаписатьЛог(Результат, "ПолучитьНастройкиПроекта");
	
КонецПроцедуры

&Порядок(3)
&Тест
Процедура ЗаполнитьНастройкиПроекта() Экспорт
	
	Настройки = Новый Соответствие();
	Настройки.Вставить("logs_req_headers", Ложь);
	Настройки.Вставить("logs_req_body"   , Ложь);
	
	Опции = Новый Структура;
	Опции.Вставить("proj", ПутьПроекта);
	Опции.Вставить("set" , Настройки);
	
	Результат = TestTools.ВыполнитьТестCLI("ЗаполнитьНастройкиПроекта", Опции);
	
	Ожидаем.Что(Результат["result"]).Равно(Истина);
	
	TestTools.ЗаписатьЛог(Результат, "ЗаполнитьНастройкиПроекта");
	
	Опции.Удалить("set");
	
	Результат = TestTools.ВыполнитьТестCLI("ПолучитьНастройкиПроекта", Опции);
	Headers   = Ложь;
	Body      = Ложь;
	
	Для Каждого ТекущаяНастройка Из Результат["data"] Цикл
		
		Если ТекущаяНастройка["name"] = "logs_req_headers" Тогда
			Ожидаем.Что(ТекущаяНастройка["value"]).Равно("false");
			Headers = Истина;
		КонецЕсли;
		
		Если ТекущаяНастройка["name"] = "logs_req_body" Тогда
			Ожидаем.Что(ТекущаяНастройка["value"]).Равно("false");
			Body = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Ожидаем.Что(Headers И Body).Равно(Истина);
	
КонецПроцедуры

&Порядок(4)
&Тест
Процедура УстановитьНастройкуПроекта() Экспорт
	
	Опции = Новый Структура;
	Опции.Вставить("proj" , ПутьПроекта);
	Опции.Вставить("key"  , "logs_path");
	Опции.Вставить("value", "yo");
	
	Результат = TestTools.ВыполнитьТестCLI("УстановитьНастройкуПроекта", Опции);
	
	Ожидаем.Что(Результат["result"]).Равно(Истина);
	
	TestTools.ЗаписатьЛог(Результат, "УстановитьНастройкуПроекта");
	
	Опции.Удалить("key");
	Опции.Удалить("value");
	
	Результат = TestTools.ВыполнитьТестCLI("ПолучитьНастройкиПроекта", Опции);
	Path      = Ложь;
	
	Для Каждого ТекущаяНастройка Из Результат["data"] Цикл
		
		Если ТекущаяНастройка["name"] = "logs_path" Тогда
			Ожидаем.Что(ТекущаяНастройка["value"]).Равно("yo");
			Path = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Ожидаем.Что(Path).Равно(Истина);
	
КонецПроцедуры

&Порядок(5)
&Тест
Процедура ДобавитьОбработчикЗапросов() Экспорт
	
	Библиотека = "telegram";
	МетодОПИ   = "ОтправитьТекстовоеСообщение";
	МетодHTTP  = "get";
	
	Опции = Новый Структура;
	Опции.Вставить("proj"  , ПутьПроекта);
	Опции.Вставить("lib"   , Библиотека);
	Опции.Вставить("func"  , МетодОПИ);
	Опции.Вставить("method", МетодHTTP);
	
	Результат = TestTools.ВыполнитьТестCLI("ДобавитьОбработчикЗапросов", Опции);
	
	КлючОбработчика = Результат["key"];
	
	Ожидаем.Что(Результат["result"]).Равно(Истина);
	Ожидаем.Что(КлючОбработчика).Заполнено();
	Ожидаем.Что(Результат["url_example"]).Заполнено();
	
	TestTools.ЗаписатьЛог(Результат, "ДобавитьОбработчикЗапросов");	
	
КонецПроцедуры

&Порядок(6)
&Тест
Процедура ПолучитьСписокОбработчиковЗапросов() Экспорт
	
	Опции = Новый Структура;
	Опции.Вставить("proj", ПутьПроекта);
	
	Результат = TestTools.ВыполнитьТестCLI("ПолучитьСписокОбработчиковЗапросов", Опции);
	
	Ожидаем.Что(Результат["result"]).Равно(Истина);
	Ожидаем.Что(Результат["data"]).ИмеетТип("Массив").ИмеетДлину(1);
	
	TestTools.ЗаписатьЛог(Результат, "ПолучитьСписокОбработчиковЗапросов");
	
КонецПроцедуры

&Порядок(7)
&Тест
Процедура ПолучитьОбработчикЗапросов() Экспорт

	Опции = Новый Структура;
	Опции.Вставить("proj"   , ПутьПроекта);
	Опции.Вставить("handler", КлючОбработчика);

	Результат = TestTools.ВыполнитьТестCLI("ПолучитьОбработчикЗапросов", Опции);
	
	Ожидаем.Что(Результат["result"]).Равно(Истина);
	Ожидаем.Что(Результат["data"]).ИмеетТип("Соответствие");
	Ожидаем.Что(Результат["data"]["function"]).Равно("ОтправитьТекстовоеСообщение");
	Ожидаем.Что(Результат["data"]["library"]).Равно("telegram");
	Ожидаем.Что(Результат["data"]["method"]).Равно("GET");
	Ожидаем.Что(Результат["data"]["key"]).Равно(КлючОбработчика);
	Ожидаем.Что(Результат["data"]["active"]).Равно(1);
	Ожидаем.Что(Результат["data"]["args"]).ИмеетТип("Массив").ИмеетДлину(0);
	
	TestTools.ЗаписатьЛог(Результат, "ПолучитьСписокОбработчиковЗапросов");

КонецПроцедуры

#КонецОбласти