#Использовать asserts
#Использовать ".."

&Тест
Процедура ТестДолжен_ПроинициализироватьПроцессорКоллекций() Экспорт
	ПроцессорКоллекций = Новый ПроцессорКоллекций;
КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроинициализироватьПроцессорКоллекцийЧерезПомощник() Экспорт
	ПроцессорКоллекций = ПроцессорыКоллекций.ИзКоллекции(Новый Массив);
	Ожидаем.Что(ПроцессорКоллекций).ИмеетТип("ПроцессорКоллекций");
КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроинициализироватьПроцессорКоллекцийИзСтрокиЧерезПомощник() Экспорт
	ПроцессорКоллекций = ПроцессорыКоллекций.ИзСтроки("");
	Ожидаем.Что(ПроцессорКоллекций).ИмеетТип("ПроцессорКоллекций");
КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроинициализироватьПроцессорКоллекцийИзНабораЧерезПомощник() Экспорт
	ПроцессорКоллекций = ПроцессорыКоллекций.ИзНабора(1, 2, 3);
	Ожидаем.Что(ПроцессорКоллекций).ИмеетТип("ПроцессорКоллекций");
	Ожидаем.Что(ПроцессорКоллекций.Количество()).Равно(3);
КонецПроцедуры
