#Использовать asserts
#Использовать ".."

&Тест
Процедура ТестДолжен_ПолучитьПроцессорКоллекцииИзЗаполненнойСтроки() Экспорт
	ПроцессорКоллекций = ПроцессорыКоллекций.ИзСтроки("123");
	Результат = ПроцессорКоллекций.ВМассив();
	Ожидаем.Что(Результат).ИмеетДлину(3);
КонецПроцедуры

&Тест
Процедура ТестДолжен_ПолучитьПроцессорКоллекцииИзЗаполненнойСтрокиСРазделителем() Экспорт
	ПроцессорКоллекций = ПроцессорыКоллекций.ИзСтроки("1 2 3", " ");
	Результат = ПроцессорКоллекций.ВМассив();
	Ожидаем.Что(Результат).ИмеетДлину(3);
КонецПроцедуры

&Тест
Процедура ТестДолжен_ДолженВернутьСтрокуИзСтроки() Экспорт
	ПроцессорКоллекций = ПроцессорыКоллекций.ИзСтроки("1 2 3", " ");
	Результат = ПроцессорКоллекций.ВСтроку();
	Ожидаем.Что(Результат).ИмеетДлину(3);
КонецПроцедуры

&Тест
Процедура ТестДолжен_ДолженВернутьСтрокуСРазделителемИзСтроки() Экспорт
	ПроцессорКоллекций = ПроцессорыКоллекций.ИзСтроки("1 2 3", " ");
	Результат = ПроцессорКоллекций.ВСтроку(" ");
	Ожидаем.Что(Результат).ИмеетДлину(5);
КонецПроцедуры
