&Тест
Процедура ПроверитьПарсерВерсии() Экспорт

	Парсер = Новый ПарсерВерсии("...+-2.1.22.00.dff-3dfg.12.fgg-fdf");

	ПроверитьТокен(Парсер.Следующий(), ".", Парсер.ТипРазделитель);
	ПроверитьТокен(Парсер.Следующий(), ".", Парсер.ТипРазделитель);
	ПроверитьТокен(Парсер.Следующий(), ".", Парсер.ТипРазделитель);
	ПроверитьТокен(Парсер.Следующий(), "+", Парсер.ТипРазделитель);
	ПроверитьТокен(Парсер.Следующий(), "-", Парсер.ТипРазделитель);
	
	ПроверитьТокен(Парсер.Следующий(), "2", Парсер.ТипЧисло);
	
	ПроверитьТокен(Парсер.Следующий(), ".", Парсер.ТипРазделитель);
	ПроверитьТокен(Парсер.Следующий(), "1", Парсер.ТипЧисло);
	
	ПроверитьТокен(Парсер.Следующий(), ".", Парсер.ТипРазделитель);
	ПроверитьТокен(Парсер.Следующий(), "22", Парсер.ТипЧисло);
	
	ПроверитьТокен(Парсер.Следующий(), ".", Парсер.ТипРазделитель);
	ПроверитьТокен(Парсер.Следующий(), "00", Парсер.ТипЧисло);
	
	ПроверитьТокен(Парсер.Следующий(), ".", Парсер.ТипРазделитель);
	ПроверитьТокен(Парсер.Следующий(), "dff", Парсер.ТипТекст);
	
	ПроверитьТокен(Парсер.Следующий(), "-", Парсер.ТипРазделитель);
	ПроверитьТокен(Парсер.Следующий(), "3dfg", Парсер.ТипТекст);
	
	ПроверитьТокен(Парсер.Следующий(), ".", Парсер.ТипРазделитель);
	ПроверитьТокен(Парсер.Следующий(), "12", Парсер.ТипЧисло);

	ПроверитьТокен(Парсер.Следующий(), ".", Парсер.ТипРазделитель);
	ПроверитьТокен(Парсер.Следующий(), "fgg", Парсер.ТипТекст);

	ПроверитьТокен(Парсер.Следующий(), "-", Парсер.ТипРазделитель);
	ПроверитьТокен(Парсер.Следующий(), "fdf", Парсер.ТипТекст);

	ПроверитьТокен(Парсер.Следующий(), "", Парсер.ТипКонецТекста);
	ПроверитьТокен(Парсер.Следующий(), "", Парсер.ТипКонецТекста);
	ПроверитьТокен(Парсер.Следующий(), "", Парсер.ТипКонецТекста);

КонецПроцедуры

&Тест
Процедура ПроверитьЗаканчивающеесяНаРазделитель() Экспорт
	Парсер = Новый ПарсерВерсии("23-");

	ПроверитьТокен(Парсер.Следующий(), "23", Парсер.ТипЧисло);
	ПроверитьТокен(Парсер.Следующий(), "-", Парсер.ТипРазделитель);
	ПроверитьТокен(Парсер.Следующий(), "", Парсер.ТипКонецТекста);
	ПроверитьТокен(Парсер.Следующий(), "", Парсер.ТипКонецТекста);
КонецПроцедуры

&Тест
Процедура ПроверитьЕдиничноеЧисло() Экспорт
	Парсер = Новый ПарсерВерсии("23");

	ПроверитьТокен(Парсер.Следующий(), "23", Парсер.ТипЧисло);
	ПроверитьТокен(Парсер.Следующий(), "", Парсер.ТипКонецТекста);
	ПроверитьТокен(Парсер.Следующий(), "", Парсер.ТипКонецТекста);
КонецПроцедуры

&Тест
Процедура ПроверитьЕдиничныйТекст() Экспорт
	Парсер = Новый ПарсерВерсии("a23");

	ПроверитьТокен(Парсер.Следующий(), "a23", Парсер.ТипТекст);
	ПроверитьТокен(Парсер.Следующий(), "", Парсер.ТипКонецТекста);
	ПроверитьТокен(Парсер.Следующий(), "", Парсер.ТипКонецТекста);
КонецПроцедуры


&Тест
Процедура ПроверитьОшибку() Экспорт
	Парсер = Новый ПарсерВерсии("a23-%^");

	ПроверитьТокен(Парсер.Следующий(), "a23", Парсер.ТипТекст);
	ПроверитьТокен(Парсер.Следующий(), "-", Парсер.ТипРазделитель);
	ПроверитьТокен(Парсер.Следующий(), "Недопустимый символ '%' в позиции 5", Парсер.ТипОшибка);
	ПроверитьТокен(Парсер.Следующий(), "", Парсер.ТипКонецТекста);
КонецПроцедуры

Процедура ПроверитьТокен(Знач Токен, Знач Значение, Знач Тип)
	Ожидаем.Что(Токен.Значение).Равно(Значение);
	Ожидаем.Что(Токен.Тип).Равно(Тип);
КонецПроцедуры