&АннотацияБезПараметра
&АннотацияСПараметром("Значение")
&АннотацияСИменованнымПараметром(ИмяПараметра = "Значение", Описание = "Многострочное
|Описание")
Перем Поле Экспорт;

&АннотацияБезПараметра
&АннотацияСПараметром("Значение")
&АннотацияСИменованнымПараметром(ИмяПараметра = "Значение", Описание = "Многострочное
|Описание")
Перем ПриватноеПоле;

&АннотацияБезПараметра
&АннотацияСПараметром("Значение")
&АннотацияСИменованнымПараметром(ИмяПараметра = "Значение", Описание = "Многострочное
|Описание")
Функция ТестоваяФункция() Экспорт
	Возврат 1;
КонецФункции

&АннотацияБезПараметра
&АннотацияСПараметром("Значение")
&АннотацияСИменованнымПараметром(ИмяПараметра = "Значение", Описание = "Многострочное
|Описание")
Процедура ТестоваяПроцедура() Экспорт
	Поле = "ЯТестоваяПроцедураЯВыполнился";
КонецПроцедуры

Функция ТестоваяФункцияСоЗначениемПараметраПоУмолчанию(Парам = 1) Экспорт
	Возврат Парам;
КонецФункции

Процедура ИзменитьЗначениеПоля(&АннотацияБезПараметра &АннотацияСПараметром("Значение") &АннотацияСИменованнымПараметром(ИмяПараметра = "Значение", Описание = "Многострочное
|Описание") НовоеЗначение) Экспорт
	Поле = НовоеЗначение;
КонецПроцедуры

Процедура ИзменитьЗначениеПоляИВызватьИсключение(НовоеЗначение) Экспорт
	Поле = НовоеЗначение;
	ВызватьИсключение "ЯОжидаемаяОшибка";
КонецПроцедуры

Процедура ИзменитьЗначениеПриватногоПоля(НовоеЗначение) Экспорт
	ПриватноеПоле = НовоеЗначение;
КонецПроцедуры

Процедура ИзменитьЗначениеПриватногоПоляИВызватьИсключение(НовоеЗначение) Экспорт
	ПриватноеПоле = НовоеЗначение;
	ВызватьИсключение "ЯОжидаемаяОшибка";
КонецПроцедуры

Функция ВернутьЭтотОбъект() Экспорт
	Возврат ЭтотОбъект;
КонецФункции

Процедура ВыброситьИсключение() Экспорт
	ВызватьИсключение "Ошибка";
КонецПроцедуры
